'''
    1. x가 5로 나누어 떨어지면 5로 나눈다.
    2. x가 3으로 나누어 떨어지면 3으로 나눈다.
    3. x가 2로 나누어 떨어지면 2로 나눈다.
    4. x에서 1을 뺀다.
    위 4가지 연산을 사용하여 1로 만드는 최소 횟수를 구하시오.
'''
x = int(input())
dp = [0] * 30001
dp[2] = 1 # 1빼기
dp[3] = 1 # 3으로 나누기
dp[4] = 2 # 2로 두 번 나누기
dp[5] = 1 # 5로 나누기


for i in range(6, x + 1):
    dp[i] = dp[i - 1] + 1
    if i % 2 == 0:
        dp[i] = min(dp[i], dp[i // 2] + 1)
    if i % 3 == 0:
        dp[i] = min(dp[i], dp[i // 3] + 1)
    if i % 5 == 0:
        dp[i] = min(dp[i], dp[i // 5] + 1)

print(dp[x])
    